# 450+ Practice Questions From Pandas, NumPy, and SQL.

Author: **Avi Chawla**

LinkedIn: https://www.linkedin.com/in/avi-chawla/

Read my newsletter here: https://www.blog.dailydoseofds.com/

## Introduction

This notebook has been created for you to practice three of the most common tools used in building any machine learning or data science applications, i.e., Pandas, NumPy, and SQL!

The practice questions provided will serve as a great resource for those who are looking to familiarize themselves with some of the most common functions used in these tools.

Appropriate descriptions have been provided for all the questions in this entire exercise which will help you navigate through this exercise easily. If a dataset is to be loaded in the python environment, that has also been provided for you. You can find it on the right panel in the Files section. Do NOT delete any of the files/folders listed there.

The whole exercise has been divided into nine separate notebooks. Below are the links to all the other notebooks for you to jump from one notebook to another:

- **Pandas**

1. Pandas Notebook 1: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-Notebook-1-d693ac55-6455-40cf-ae34-867c6a02014e/notebook/6449493c84734151b11f4b6871f045d2#99f75bf946d04b9bb1daa9e14c2cfea9) 
2. Pandas Notebook 2: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-Notebook-employee-dataset-7e3b6755-5d4b-464b-9b75-9c84667ae3bd/notebook/notebook-0de50f3b70834570b13b651dde44c491) **(This Notebook)** 

3. Pandas Notebook 3: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-Notebook-employee-part-2-adc5a3ee-5f61-4725-8e46-ccb07899acfc/notebook/notebook-78e3faf901da4f14881ef24e41c80bf6)

4. Pandas Notebook 4: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-after-employee-f84e02a1-fb6a-428e-af90-8dd99855749a/notebook/notebook-134ac20c38ef45e5a4432abd638e6c2e)

- **NumPy**

1. NumPy Notebook 1: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Numpy-part-1-9b9979f2-b708-4292-b466-3d0157564c91/notebook/notebook-07232b5ebafe49b198a9c55c553414f1)

2. NumPy Notebook 2: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/NumPy-Notebook-2-4456411e-2ddd-426d-8027-4881080027db/notebook/notebook-988aba30f33a45a3861adc4f6a6f338c)

3. NumPy Notebook 3: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/NumPy-Notebook-3-e6587114-b580-4249-b599-540de859e603/notebook/notebook-bb52759ea3f542eaaed9958b5df9c34b)

- **SQL**

1. SQL Notebook 1: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/SQL-Notebook-1-eac9d782-a9b1-4e84-a1f9-af14080a6121/notebook/notebook-697f04297c664d02901db0f85431512e)

2. SQL Notebook 2: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/SQL-Notebook-2-1914b214-be03-44a1-be63-ad99e98be639/notebook/notebook-e549236b988c42a5b53126a7ebb98127)

## How to use this notebook?

At the top right corner, you will find a Duplicate button. This will allow you to create a unique notebook for your own practice and write solutions to the question listed in this notebook.

If you face any issues or have any feedback, feel free to reach out to me (Avi Chawla) either on Linkedin: https://www.linkedin.com/in/avi-chawla/ or write an email to avi@dsscholar[dot]com.

Let's begin ðŸš€!

In [3]:
import pandas as pd
import numpy as np

# Pandas Notebook 2

### 31. Read the CSV file.

In [4]:
file_name = "employee_dataset.csv"

df = pd.read_csv(file_name)

### 32. Print the first 5 rows.

In [5]:
df_temp = df.head()

print(df_temp)

             Name                  Company_Name  \
0  Spencer Adkins                James and Sons
1    Julie Morton                 Nichols-James
2    Matthew Hall                     Scott Inc
3      Brad Scott  Johnston, Fleming and Tanner
4   Theresa Owens      Baker, Allen and Edwards

                        Employee_Job_Title      Employee_City  \
0                          Equities trader     New Russellton
1  Diplomatic Services operational officer  North Melissafurt
2               Regulatory affairs officer           Wardfort
3                      Production engineer     West Jamesview
4                      Production engineer          Whiteside

        Employee_Country  Employee_Salary Employment_Status  Employee_Rating
0  Palestinian Territory           321520         Full Time              3.9
1       Marshall Islands           589090         Full Time              4.3
2               Anguilla           630890         Full Time              3.1
3   Syrian Arab Republic           116400         Full Time              3.1
4               Dominica           523499         Full Time              4.8

### 33. Print the last 10 rows.

In [6]:
df_temp = df.tail(10)

print(df_temp)

                     Name                  Company_Name  \
299990      Monica Bender    Wallace, Smith and Shepard
299991  William Rodriguez                     Scott Inc
299992    Steven Thornton      Baker, Allen and Edwards
299993         Terry Hill       White, Mcclain and Cobb
299994      Kelly Bennett       White, Mcclain and Cobb
299995         Nancy Neal              Bullock-Carrillo
299996     Michele Butler  Johnston, Fleming and Tanner
299997        Lynn Wilson                 Nichols-James
299998      Lindsey Keith                 Nichols-James
299999      Karen Delgado                James and Sons

                  Employee_Job_Title      Employee_City Employee_Country  \
299990           Production engineer   New Cindychester       Bangladesh
299991                    Ergonomist          Whiteside      New Zealand
299992               Patent examiner         Aliciafort            Benin
299993  Investment banker, corporate   New Cindychester           Sweden
299994     Radiographer, therapeutic           Wardfort             Fiji
299995                   Optometrist  North Melissafurt            Samoa
299996                 Administrator         Aliciafort             Cuba
299997                 Administrator   New Cindychester          Bolivia
299998                          Make       Whitakerbury   Western Sahara
299999                       Actuary     New Russellton   United Kingdom

        Employee_Salary Employment_Status  Employee_Rating
299990           852660         Full Time              3.0
299991           214400         Full Time              1.5
299992            60240         Full Time              4.3
299993           414720            Intern              2.3
299994           182270         Full Time              3.6
299995            99670            Intern              3.3
299996           949580            Intern              2.6
299997           802830         Full Time              0.6
299998           257240         Full Time              2.4
299999           575770            Intern              3.3

### 34. Print the number of rows.

In [16]:
df = pd.read_csv("employee_dataset.csv")
rows = df.shape[0]
# To print both rows and columns df.shape
print(rows)

300000

### 35. Print the number of columns.

In [17]:
columns = df.shape[1]

print(columns)

8

### 36. Print all column names.

In [18]:
column_names = df.columns

print(column_names)

Index(['Name', 'Company_Name', 'Employee_Job_Title', 'Employee_City',
       'Employee_Country', 'Employee_Salary', 'Employment_Status',
       'Employee_Rating'],
      dtype='object')

### 37. Print the mean of Employee_Salary.

In [20]:
employee_salary_mean = df['Employee_Salary'].mean()
print(f"Mean of Employee_Salary: {employee_salary_mean}")

Mean of Employee_Salary: 500224.20772666665

### 38. Print the mean of Employee_Rating.

In [21]:
employee_rating_mean = df['Employee_Rating'].mean()
print(f"Mean of Employee_Rating: {employee_rating_mean}")

Mean of Employee_Rating: 2.5059550000000006

### 39. Print the number of distinct Company_Name.

In [25]:
num_distinct_companies = df['Company_Name'].nunique()
print(f"Number of distinct Company_Name: {num_distinct_companies}")

Number of distinct Company_Name: 15

### 40. Print all the distinct Company_Name.

In [26]:
distinct_companies = df['Company_Name'].unique()
print(f"Distinct Company_Name values: {distinct_companies}")

Distinct Company_Name values: ['James and Sons' 'Nichols-James' 'Scott Inc'
 'Johnston, Fleming and Tanner' 'Baker, Allen and Edwards' 'Andrade LLC'
 'Matthews Inc' 'Taylor-Ramos' 'Campos, Reynolds and Mccormick'
 'White, Mcclain and Cobb' 'Thomas-Spencer' 'Bullock-Carrillo'
 'Marshall-Holloway' 'Wallace, Smith and Shepard' 'Nelson-Li']

### 41. Print the number of employees working in the company "Nichols-James".

In [28]:
nichols_james = df['Company_Name'] == 'Nichols-James'
num_employees = df[nichols_james].shape[0]
print(f"Number of Employees in Nichols-James: {num_employees}")

Number of Employees in Nichols-James: 19911

### 42-44. Print the maximum, minimum and median Employee_Salary.

In [29]:
max_employee_salary = df['Employee_Salary'].max()
min_employee_salary = df['Employee_Salary'].min()
median_employee_salary = df['Employee_Salary'].median()

print(f"Maximum Employee Salary: {max_employee_salary}")
print(f"Minimum Employee Salary: {min_employee_salary}")
print(f"Median Employee Salary: {median_employee_salary}")

Maximum Employee Salary: 999990
Minimum Employee Salary: 0
Median Employee Salary: 500780.0

### 45-49. Print the distribution of the following columns: (the frequency of individual entries).

1. Company_Name

In [30]:
print("Distribution of Company_Name:")
print(df['Company_Name'].value_counts())

Distribution of Company_Name:
Company_Name
Scott Inc                         20390
White, Mcclain and Cobb           20261
Thomas-Spencer                    20142
Nelson-Li                         20132
Taylor-Ramos                      20122
Baker, Allen and Edwards          20084
Matthews Inc                      20083
Bullock-Carrillo                  20063
Andrade LLC                       19983
Campos, Reynolds and Mccormick    19927
Nichols-James                     19911
James and Sons                    19868
Marshall-Holloway                 19859
Johnston, Fleming and Tanner      19811
Wallace, Smith and Shepard        19364
Name: count, dtype: int64

2. Employee_Job_Title

In [31]:
print("Distribution of Employee_Job_Title:")
print(df['Employee_Job_Title'].value_counts())

Distribution of Employee_Job_Title:
Employee_Job_Title
Diplomatic Services operational officer                  30137
Administrator                                            15222
Garment/textile technologist                             15183
Trading standards officer                                15155
Patent examiner                                          15085
Armed forces logistics/support/administrative officer    15050
Retail merchandiser                                      15033
Energy manager                                           15033
Actuary                                                  15030
Investment banker, corporate                             15008
Ergonomist                                               15006
Production engineer                                      15003
Equities trader                                          15000
Naval architect                                          14905
Radiographer, therapeutic                                14882
Regulatory affairs officer                               14869
Optometrist                                              14838
Sales promotion account executive                        14820
Make                                                     14741
Name: count, dtype: int64

3. Employee_City

In [32]:
print("Distribution of Employee_City:")
print(df['Employee_City'].value_counts())

Distribution of Employee_City:
Employee_City
North Melissafurt    30209
Kristaburgh          30204
Wardfort             30097
Ricardomouth         30052
Aliciafort           30037
New Russellton       30001
West Jamesview       29941
Whitakerbury         29854
Whiteside            29849
New Cindychester     29756
Name: count, dtype: int64

4. Employee_Country

In [33]:
print("Distribution of Employee_Country:")
print(df['Employee_Country'].value_counts())

Distribution of Employee_Country:
Employee_Country
Congo                                                  2413
Korea                                                  2301
British Indian Ocean Territory (Chagos Archipelago)    1344
Egypt                                                  1322
Turkey                                                 1308
                                                       ...
Saint Vincent and the Grenadines                       1147
Czech Republic                                         1145
Mexico                                                 1144
Mauritania                                             1139
Ukraine                                                1133
Name: count, Length: 243, dtype: int64

5. Employment_Status

In [34]:
print("Distribution of Employment_Status:")
print(df['Employment_Status'].value_counts())

Distribution of Employment_Status:
Employment_Status
Full Time    240010
Intern        59990
Name: count, dtype: int64

### 50. Print the company with the most number of employees.

In [36]:
# Group by 'Company_Name' and count the number of employees per company
company_counts = df['Company_Name'].value_counts()

# Find the company with the most number of employees
most_employees_company = company_counts.idxmax()

# Print the company with the most number of employees and the count
print(f"Company with the most number of employees: {most_employees_company}")

Company with the most number of employees: Scott Inc

### 51. Print the number of employees in the above company.

In [37]:
most_employees_count = company_counts.max()
print(f"Number of employees: {most_employees_count}")

Number of employees: 20390

### 52. Print the company with the least number of employees.

In [39]:
least_employees_company = company_counts.idxmin()
print(f"Company with least number of employees: {least_employees_company}")

Company with least number of employees: Wallace, Smith and Shepard

### 53. Print the number of employees in the above company.

In [40]:
least_employees_count = company_counts.min()
print(f"Number of employees: {least_employees_count}")

Number of employees: 19364

### 54. Print the employee details with the maximum salary

In [41]:
# Find the maximum salary
max_salary = df['Employee_Salary'].max()

# Filter DataFrame to get the employee details with the maximum salary
employee_max_salary = df[df['Employee_Salary'] == max_salary]
print(f"Employee details with the maximum salary: {employee_max_salary}")

Employee details with the maximum salary:               Name  Company_Name   Employee_Job_Title Employee_City  \
70356  Anna Lawson  Taylor-Ramos  Production engineer   Kristaburgh

      Employee_Country  Employee_Salary Employment_Status  Employee_Rating
70356          Lesotho           999990         Full Time              4.0

### 55. Print the employee details with the maximum rating

In [42]:
# Find the maximum rating
max_rating = df['Employee_Rating'].max()

# Filter DataFrame to get the employee details with the maximum rating
employee_max_rating = df[df['Employee_Rating'] == max_rating]
print(f"Employee details with the maximum rating: {employee_max_rating}")

Employee details with the maximum rating:                     Name                  Company_Name  \
124       Joshua Huffman                James and Sons
342         Alan Carlson      Baker, Allen and Edwards
391         Lisa Summers  Johnston, Fleming and Tanner
395        Timothy Woods  Johnston, Fleming and Tanner
415      Cameron Hawkins                  Taylor-Ramos
...                  ...                           ...
299689    Michael Jordan  Johnston, Fleming and Tanner
299855  Rebecca Garrison                     Nelson-Li
299900      Daniel Jones                  Taylor-Ramos
299906     Justin Mendez              Bullock-Carrillo
299973      Doris Miller                   Andrade LLC

                                       Employee_Job_Title      Employee_City  \
124                          Garment/textile technologist     New Russellton
342               Diplomatic Services operational officer        Kristaburgh
391                            Regulatory affairs officer  North Melissafurt
395                          Garment/textile technologist          Whiteside
415     Armed forces logistics/support/administrative ...           Wardfort
...                                                   ...                ...
299689                                    Naval architect       Whitakerbury
299855                                Production engineer       Whitakerbury
299900                  Sales promotion account executive        Kristaburgh
299906                         Regulatory affairs officer   New Cindychester
299973  Armed forces logistics/support/administrative ...           Wardfort

                    Employee_Country  Employee_Salary Employment_Status  \
124                     Cook Islands           694760         Full Time
342                         Mongolia           491710            Intern
391                             Togo           933500         Full Time
395     United States Virgin Islands           367630         Full Time
415                         Tanzania            66570            Intern
...                              ...              ...               ...
299689                   Philippines           474540         Full Time
299855                       Ireland           592530         Full Time
299900                  Sierra Leone            32160         Full Time
299906                      Colombia           374540         Full Time
299973                    Kazakhstan           943340            Intern

        Employee_Rating
124                 5.0
342                 5.0
391                 5.0
395                 5.0
415                 5.0
...                 ...
299689              5.0
299855              5.0
299900              5.0
299906              5.0
299973              5.0

[2985 rows x 8 columns]

### 56. Print the Company_Name with most number of employees in 'Wardfort' city.

In [46]:
# Filter the DataFrame for employees in 'Wardfort' city
df_wardfort = df[df['Employee_City'] == 'Wardfort']

# Group by 'Company_Name' and count the number of employees per company
company_counts = df_wardfort['Company_Name'].value_counts()

# Find the company with the most number of employees in 'Wardfort'
most_employees_company = company_counts.idxmax()
most_employees_count = company_counts.max()

# Print the company with the most number of employees in 'Wardfort' and the count
print(f"Company with the most number of employees in 'Wardfort': {most_employees_company}")
print(f"Number of employees: {most_employees_count}")

Company with the most number of employees in 'Wardfort': White, Mcclain and Cobb
Number of employees: 2069

### 57. Change the Data type of 'Employee_Salary' column to float.

In [47]:
import pandas as pd

# File path
file_name = "employee_dataset.csv"

# Read CSV file into DataFrame
df = pd.read_csv(file_name)

# Change the data type of 'Employee_Salary' column to float
df['Employee_Salary'] = df['Employee_Salary'].astype(float)

# Verify the change by printing the data types
print(df.dtypes)

Name                   object
Company_Name           object
Employee_Job_Title     object
Employee_City          object
Employee_Country       object
Employee_Salary       float64
Employment_Status      object
Employee_Rating       float64
dtype: object

### 58. Print the Employee_City with the most number of 'Production engineer'.

In [49]:
# Filter the DataFrame for 'Production Engineer' job title
df_production_engineer = df[df['Employee_Job_Title'] == 'Production engineer']

# Group by 'Employee_City' and count the number of employees per city
city_counts = df_production_engineer['Employee_City'].value_counts()

# Find the city with the most number of 'Production Engineer'
most_employees_city = city_counts.idxmax()
most_employees_count = city_counts.max()

# Print the city with the most number of 'Production Engineer' and the count
print(f"City with the most number of 'Production Engineer': {most_employees_city}")
print(f"Number of 'Production Engineer' in that city: {most_employees_count}")

City with the most number of 'Production Engineer': Aliciafort
Number of 'Production Engineer' in that city: 1588

### 59. Print the Company_Name with the most number of Full-time Employees.

In [97]:
# Filter rows where 'Employment_Status' is 'Full-time'
full_time_employees = df[df['Employment_Status'] == 'Full-time']

# Group by 'Company_Name' and count the number of employees
full_time_employee_counts = full_time_employees['Company_Name'].value_counts()

# Get the company with the maximum full-time employees
company_with_max_full_time_employees = full_time_employee_counts.idxmax()

# Print the company name
print(f"The company with the most number of full-time employees is: {company_with_max_full_time_employees}")

ValueError: attempt to get argmax of an empty sequence

### 60. Print the Company_Name with the highest average 'Employee_Rating'.

In [54]:
# Group by 'Company_Name' and calculate the average 'Employee_Rating' for each company
average_ratings = df.groupby('Company_Name')['Employee_Rating'].mean()

# Find the company with the highest average rating
highest_avg_rating_company = average_ratings.idxmax()
highest_avg_rating = average_ratings.max()

# Print the company with the highest average rating and the average rating
print(f"Company with the highest average 'Employee_Rating': {highest_avg_rating_company}")
print(f"Highest average 'Employee_Rating': {highest_avg_rating}")

Company with the highest average 'Employee_Rating': Matthews Inc
Highest average 'Employee_Rating': 2.5254543643877905

### 61. Print the number of employees working in 'Ricardomouth' and 'Kristaburgh' location combined.

In [55]:
# Filter the DataFrame for employees in 'Ricardomouth' and 'Kristaburgh'
df_filtered = df[df['Employee_City'].isin(['Ricardomouth', 'Kristaburgh'])]

# Count the number of employees in the filtered DataFrame
num_employees_combined = df_filtered.shape[0]

# Print the number of employees working in 'Ricardomouth' and 'Kristaburgh' combined
print(f"Number of employees working in 'Ricardomouth' and 'Kristaburgh': {num_employees_combined}")

Number of employees working in 'Ricardomouth' and 'Kristaburgh': 60256

### 62. Print the distinct Company_Name corresponding to the 5 highest paid employees in the dataset.

In [57]:
# Sort the DataFrame by 'Employee_Salary' in descending order
df_sorted = df.sort_values(by='Employee_Salary', ascending=False)

# Select the top 5 highest-paid employees
top_5_employees = df_sorted.head(5)

# Extract the distinct 'Company_Name' values
distinct_companies = top_5_employees['Company_Name'].unique()

# Print the distinct 'Company_Name' corresponding to the 5 highest-paid employees
print("Distinct Company_Name corresponding to the 5 highest-paid employees:")
print(distinct_companies)

Distinct Company_Name corresponding to the 5 highest-paid employees:
['Taylor-Ramos' 'Thomas-Spencer' 'White, Mcclain and Cobb'
 'Campos, Reynolds and Mccormick']

### 63. Check if there are any duplicate rows in the DataFrame.

In [59]:
duplicated_rows = df.duplicated().any()

# Print if there are any duplicate rows
if duplicated_rows:
    print("There are duplicate rows in the DataFrame.")
else:
    print("There are no duplicate rows in the DataFrame.")

There are no duplicate rows in the DataFrame.

### 64. Check if any of the columns has NaN values.

In [60]:
# Check for NaN values in each column
nan_columns = df.isnull().any()

# Print columns that have NaN values
columns_with_nan = nan_columns[nan_columns].index.tolist()

if columns_with_nan:
    print("Columns with NaN values:")
    print(columns_with_nan)
else:
    print("No columns have NaN values.")

No columns have NaN values.

### 65. Print the data type of every column in the DataFrame.

In [61]:
# Print the data type of every column
print("Data types of each column in the DataFrame:")
print(df.dtypes)

Data types of each column in the DataFrame:
Name                   object
Company_Name           object
Employee_Job_Title     object
Employee_City          object
Employee_Country       object
Employee_Salary       float64
Employment_Status      object
Employee_Rating       float64
dtype: object

### 66. Print the Company_Name column only as a Series

In [62]:
# Print the 'Company_Name' column as a Series
company_name_series = df['Company_Name']
print(company_name_series)

0                       James and Sons
1                        Nichols-James
2                            Scott Inc
3         Johnston, Fleming and Tanner
4             Baker, Allen and Edwards
                      ...
299995                Bullock-Carrillo
299996    Johnston, Fleming and Tanner
299997                   Nichols-James
299998                   Nichols-James
299999                  James and Sons
Name: Company_Name, Length: 300000, dtype: object

### 67. Print the Company_Name column only as a DataFrame

In [63]:
# Print the 'Company_Name' column as a DataFrame
company_name_df = df[['Company_Name']]
print(company_name_df)

                        Company_Name
0                     James and Sons
1                      Nichols-James
2                          Scott Inc
3       Johnston, Fleming and Tanner
4           Baker, Allen and Edwards
...                              ...
299995              Bullock-Carrillo
299996  Johnston, Fleming and Tanner
299997                 Nichols-James
299998                 Nichols-James
299999                James and Sons

[300000 rows x 1 columns]

### 68. Select the 'Employee_Job_Title' and 'Employee_City' column.

In [64]:
selected_columns = df[['Employee_Job_Title', 'Employee_City']]
print(selected_columns)

                             Employee_Job_Title      Employee_City
0                               Equities trader     New Russellton
1       Diplomatic Services operational officer  North Melissafurt
2                    Regulatory affairs officer           Wardfort
3                           Production engineer     West Jamesview
4                           Production engineer          Whiteside
...                                         ...                ...
299995                              Optometrist  North Melissafurt
299996                            Administrator         Aliciafort
299997                            Administrator   New Cindychester
299998                                     Make       Whitakerbury
299999                                  Actuary     New Russellton

[300000 rows x 2 columns]

### 69. Print the number of employees with Employee_Rating greater than the average Employee_Rating

In [65]:
# Calculate the average Employee_Rating
average_rating = df['Employee_Rating'].mean()

# Filter the DataFrame for employees with Employee_Rating greater than the average
above_average_rating_df = df[df['Employee_Rating'] > average_rating]

# Count the number of employees with Employee_Rating greater than the average
num_employees_above_average = above_average_rating_df.shape[0]

# Print the number of employees with Employee_Rating greater than the average
print(f"Number of employees with Employee_Rating greater than the average: {num_employees_above_average}")

Number of employees with Employee_Rating greater than the average: 147548

### 70. Find the employee which has the maximum salary among the ones with  the minimum Employee_Rating

In [66]:
# Find the minimum Employee_Rating
min_rating = df['Employee_Rating'].min()

# Filter the DataFrame for employees with the minimum Employee_Rating
min_rating_employees = df[df['Employee_Rating'] == min_rating]

# Find the employee with the maximum salary among those with the minimum Employee_Rating
max_salary_employee = min_rating_employees.loc[min_rating_employees['Employee_Rating'].idxmax()]

# Print the details of the employee with the maximum salary among those with the minimum Employee_Rating
print("Employee with the maximum salary among those with the minimum Employee_Rating:")
print(max_salary_employee)

Employee with the maximum salary among those with the minimum Employee_Rating:
Name                         Gary Jackson
Company_Name             Bullock-Carrillo
Employee_Job_Title    Production engineer
Employee_City                  Aliciafort
Employee_Country                Macedonia
Employee_Salary                  141250.0
Employment_Status               Full Time
Employee_Rating                       0.0
Name: 32, dtype: object

### 71. Sort the DataFrame in ascending order of Employee_Salary

In [67]:
# Sort the DataFrame in ascending order of 'Employee_Salary'
df_sorted = df.sort_values(by='Employee_Salary', ascending=True)
print(df_sorted)

                      Name                    Company_Name  \
54531      Kristen Vasquez         White, Mcclain and Cobb
205070  Courtney Singleton         White, Mcclain and Cobb
185700          Vanessa Wu  Campos, Reynolds and Mccormick
226792          Penny Meza      Wallace, Smith and Shepard
229395         Grace Smith    Johnston, Fleming and Tanner
...                    ...                             ...
23536        Dennis Sexton  Campos, Reynolds and Mccormick
50461        Logan Jackson         White, Mcclain and Cobb
153993       Jason Jenkins                    Taylor-Ramos
51642      Richard Kennedy                  Thomas-Spencer
70356          Anna Lawson                    Taylor-Ramos

                                       Employee_Job_Title      Employee_City  \
54531   Armed forces logistics/support/administrative ...           Wardfort
205070                       Garment/textile technologist   New Cindychester
185700                                    Patent examiner  North Melissafurt
226792                          Trading standards officer           Wardfort
229395                          Trading standards officer     West Jamesview
...                                                   ...                ...
23536             Diplomatic Services operational officer        Kristaburgh
50461                                          Ergonomist           Wardfort
153993                  Sales promotion account executive         Aliciafort
51642                                      Energy manager         Aliciafort
70356                                 Production engineer        Kristaburgh

              Employee_Country  Employee_Salary Employment_Status  \
54531                  Bermuda              0.0         Full Time
205070                Ethiopia              0.0         Full Time
185700                  Zambia             10.0         Full Time
226792                 Albania             10.0         Full Time
229395  Libyan Arab Jamahiriya             10.0            Intern
...                        ...              ...               ...
23536           United Kingdom         999970.0         Full Time
50461             Saint Helena         999980.0         Full Time
153993                Pakistan         999980.0         Full Time
51642             Cook Islands         999980.0         Full Time
70356                  Lesotho         999990.0         Full Time

        Employee_Rating
54531               3.4
205070              2.8
185700              1.3
226792              0.7
229395              1.1
...                 ...
23536               0.9
50461               2.0
153993              2.6
51642               2.4
70356               4.0

[300000 rows x 8 columns]

### 72. Sort the DataFrame in descending order of Employee_Rating

In [69]:
df_sorted = df.sort_values(by='Employee_Rating', ascending=False)
print(df_sorted)

                     Name                  Company_Name  \
222544        Laura Lopez                     Scott Inc
26453     Adriana Ferrell  Johnston, Fleming and Tanner
141265     Russell Dorsey      Baker, Allen and Edwards
184624  Katherine Jenkins                  Matthews Inc
70533     Brittney Greene                James and Sons
...                   ...                           ...
50012           Sara King                  Matthews Inc
289392       Heather Paul                     Nelson-Li
14752     Kathryn Goodwin      Baker, Allen and Edwards
204854          Nina Yang    Wallace, Smith and Shepard
242616   Melissa Johnston                  Matthews Inc

                                       Employee_Job_Title     Employee_City  \
222544                                    Equities trader         Whiteside
26453                                          Ergonomist        Aliciafort
141265                                        Optometrist        Aliciafort
184624                                               Make  New Cindychester
70533                                      Energy manager      Ricardomouth
...                                                   ...               ...
50012             Diplomatic Services operational officer         Whiteside
289392                                               Make          Wardfort
14752                                      Energy manager  New Cindychester
204854  Armed forces logistics/support/administrative ...          Wardfort
242616            Diplomatic Services operational officer         Whiteside

                   Employee_Country  Employee_Salary Employment_Status  \
222544       British Virgin Islands         271140.0         Full Time
26453                         Gabon         678800.0            Intern
141265                      Morocco         816320.0         Full Time
184624                        Nauru         498850.0         Full Time
70533                      Bulgaria         332780.0         Full Time
...                             ...              ...               ...
50012                          Iran         986490.0            Intern
289392  French Southern Territories         712720.0         Full Time
14752                       Moldova         557330.0         Full Time
204854                    Swaziland         744300.0            Intern
242616                        Macao         704700.0            Intern

        Employee_Rating
222544              5.0
26453               5.0
141265              5.0
184624              5.0
70533               5.0
...                 ...
50012               0.0
289392              0.0
14752               0.0
204854              0.0
242616              0.0

[300000 rows x 8 columns]

### 73. Print the name of 100th employee after sorting on Name

In [70]:
df_sorted = df.sort_values(by='Name')
# Select the name of the 100th employee (index 99 since index is 0-based)
employee_100th_name = df_sorted.iloc[99]['Name']

# Print the name of the 100th employee
print(f"The name of the 100th employee after sorting by name: {employee_100th_name}")

The name of the 100th employee after sorting by name: Aaron Brown

### 74. Print the first 5 rows of the first 5 columns.

In [71]:
# Print the first 5 rows of the first 5 columns
first_5_rows_first_5_columns = df.iloc[0:5,0:5]
print(first_5_rows_first_5_columns)

             Name                  Company_Name  \
0  Spencer Adkins                James and Sons
1    Julie Morton                 Nichols-James
2    Matthew Hall                     Scott Inc
3      Brad Scott  Johnston, Fleming and Tanner
4   Theresa Owens      Baker, Allen and Edwards

                        Employee_Job_Title      Employee_City  \
0                          Equities trader     New Russellton
1  Diplomatic Services operational officer  North Melissafurt
2               Regulatory affairs officer           Wardfort
3                      Production engineer     West Jamesview
4                      Production engineer          Whiteside

        Employee_Country
0  Palestinian Territory
1       Marshall Islands
2               Anguilla
3   Syrian Arab Republic
4               Dominica

### 75. Print the transpose of the first 5 rows

In [73]:
# Select the first 5 rows
first_5_rows = df.head(5)

# Transpose the DataFrame
first_5_rows_transposed = first_5_rows.T

print(first_5_rows_transposed)

                                        0  \
Name                       Spencer Adkins
Company_Name               James and Sons
Employee_Job_Title        Equities trader
Employee_City              New Russellton
Employee_Country    Palestinian Territory
Employee_Salary                  321520.0
Employment_Status               Full Time
Employee_Rating                       3.9

                                                          1  \
Name                                           Julie Morton
Company_Name                                  Nichols-James
Employee_Job_Title  Diplomatic Services operational officer
Employee_City                             North Melissafurt
Employee_Country                           Marshall Islands
Employee_Salary                                    589090.0
Employment_Status                                 Full Time
Employee_Rating                                         4.3

                                             2                             3  \
Name                              Matthew Hall                    Brad Scott
Company_Name                         Scott Inc  Johnston, Fleming and Tanner
Employee_Job_Title  Regulatory affairs officer           Production engineer
Employee_City                         Wardfort                West Jamesview
Employee_Country                      Anguilla          Syrian Arab Republic
Employee_Salary                       630890.0                      116400.0
Employment_Status                    Full Time                     Full Time
Employee_Rating                            3.1                           3.1

                                           4
Name                           Theresa Owens
Company_Name        Baker, Allen and Edwards
Employee_Job_Title       Production engineer
Employee_City                      Whiteside
Employee_Country                    Dominica
Employee_Salary                     523499.0
Employment_Status                  Full Time
Employee_Rating                          4.8

### 76. Print the number of employees whose first name starts with the letter 'V'.

In [75]:
# Assume the 'Employee_Name' column contains full names in 'First Last' format
# Extract the first name from 'Employee_Name'
df['First_Name'] = df['Name'].apply(lambda x: x.split()[0])

# Filter the DataFrame for employees whose first name starts with 'V'
employees_with_v = df[df['First_Name'].str.startswith('V')]

# Count the number of such employees
num_employees_with_v = employees_with_v.shape[0]

# Print the number of employees whose first name starts with 'V'
print(f"Number of employees whose first name starts with 'V': {num_employees_with_v}")

Number of employees whose first name starts with 'V': 3683

### 77. Print the number of employees whose last name starts with the letter 'R'.

In [78]:
# Assume the 'Employee_Name' column contains full names in 'First Last' format
# Extract the last name from 'Employee_Name'
df['Last_Name'] = df['Name'].apply(lambda x: x.split()[-1])

# Filter the DataFrame for employees whose last name starts with 'R'
employees_with_r = df[df['Last_Name'].str.startswith('R')]

# Count the number of such employees
num_employees_with_r = employees_with_r.shape[0]

# Print the number of employees whose last name starts with 'R'
print(f"Number of employees whose last name starts with 'R': {num_employees_with_r}")

Number of employees whose last name starts with 'R': 20712

### 78. Select the rows 2 to 7 and the columns 3 to 7 (both included)

In [80]:
df_selected = df.iloc[1:7,2:7]
print(df_selected)

                        Employee_Job_Title      Employee_City  \
1  Diplomatic Services operational officer  North Melissafurt
2               Regulatory affairs officer           Wardfort
3                      Production engineer     West Jamesview
4                      Production engineer          Whiteside
5                                     Make       Ricardomouth
6                          Naval architect           Wardfort

       Employee_Country  Employee_Salary Employment_Status
1      Marshall Islands         589090.0         Full Time
2              Anguilla         630890.0         Full Time
3  Syrian Arab Republic         116400.0         Full Time
4              Dominica         523499.0         Full Time
5                  Mali         850140.0         Full Time
6                 Aruba         711410.0         Full Time

### 79. Select every row after the 10th row and select all columns.

In [82]:
df_selected = df.iloc[9:,:]
# df_selected = df.iloc[9:]
print(df_selected)

                   Name                    Company_Name  \
9       Michael Edwards  Campos, Reynolds and Mccormick
10      Victoria Sutton         White, Mcclain and Cobb
11      Timothy Johnson        Baker, Allen and Edwards
12       Tiffany Galvan  Campos, Reynolds and Mccormick
13          David Duran                   Nichols-James
...                 ...                             ...
299995       Nancy Neal                Bullock-Carrillo
299996   Michele Butler    Johnston, Fleming and Tanner
299997      Lynn Wilson                   Nichols-James
299998    Lindsey Keith                   Nichols-James
299999    Karen Delgado                  James and Sons

                             Employee_Job_Title      Employee_City  \
9                                    Ergonomist   New Cindychester
10                              Naval architect          Whiteside
11                   Regulatory affairs officer       Ricardomouth
12      Diplomatic Services operational officer     West Jamesview
13                 Investment banker, corporate     New Russellton
...                                         ...                ...
299995                              Optometrist  North Melissafurt
299996                            Administrator         Aliciafort
299997                            Administrator   New Cindychester
299998                                     Make       Whitakerbury
299999                                  Actuary     New Russellton

                        Employee_Country  Employee_Salary Employment_Status  \
9       Lao People's Democratic Republic         516950.0         Full Time
10                                Poland         656260.0         Full Time
11                               Georgia         503610.0         Full Time
12                                 Niger         786430.0            Intern
13                               Georgia         910210.0         Full Time
...                                  ...              ...               ...
299995                             Samoa          99670.0            Intern
299996                              Cuba         949580.0            Intern
299997                           Bolivia         802830.0         Full Time
299998                    Western Sahara         257240.0         Full Time
299999                    United Kingdom         575770.0            Intern

        Employee_Rating First_Name Last_Name
9                   2.3    Michael   Edwards
10                  4.9   Victoria    Sutton
11                  2.9    Timothy   Johnson
12                  3.6    Tiffany    Galvan
13                  4.9      David     Duran
...                 ...        ...       ...
299995              3.3      Nancy      Neal
299996              2.6    Michele    Butler
299997              0.6       Lynn    Wilson
299998              2.4    Lindsey     Keith
299999              3.3      Karen   Delgado

[299991 rows x 10 columns]

### 80. Select every row up to the 10th row and select all columns.

In [85]:
df_selected = df.iloc[:10]
print(df_selected)

              Name                    Company_Name  \
0   Spencer Adkins                  James and Sons
1     Julie Morton                   Nichols-James
2     Matthew Hall                       Scott Inc
3       Brad Scott    Johnston, Fleming and Tanner
4    Theresa Owens        Baker, Allen and Edwards
5    Vanessa Allen                     Andrade LLC
6      Kelly Brown                     Andrade LLC
7      Vicki Beard                    Matthews Inc
8      Lisa French                    Taylor-Ramos
9  Michael Edwards  Campos, Reynolds and Mccormick

                        Employee_Job_Title      Employee_City  \
0                          Equities trader     New Russellton
1  Diplomatic Services operational officer  North Melissafurt
2               Regulatory affairs officer           Wardfort
3                      Production engineer     West Jamesview
4                      Production engineer          Whiteside
5                                     Make       Ricardomouth
6                          Naval architect           Wardfort
7  Diplomatic Services operational officer        Kristaburgh
8                Radiographer, therapeutic     West Jamesview
9                               Ergonomist   New Cindychester

                   Employee_Country  Employee_Salary Employment_Status  \
0             Palestinian Territory         321520.0         Full Time
1                  Marshall Islands         589090.0         Full Time
2                          Anguilla         630890.0         Full Time
3              Syrian Arab Republic         116400.0         Full Time
4                          Dominica         523499.0         Full Time
5                              Mali         850140.0         Full Time
6                             Aruba         711410.0         Full Time
7                    Western Sahara         777000.0         Full Time
8                            Kuwait         870580.0         Full Time
9  Lao People's Democratic Republic         516950.0         Full Time

   Employee_Rating First_Name Last_Name
0              3.9    Spencer    Adkins
1              4.3      Julie    Morton
2              3.1    Matthew      Hall
3              3.1       Brad     Scott
4              4.8    Theresa     Owens
5              2.6    Vanessa     Allen
6              2.0      Kelly     Brown
7              3.3      Vicki     Beard
8              1.3       Lisa    French
9              2.3    Michael   Edwards

### 81. Select rows with employee rating > 4.5.

In [87]:
# Select rows with 'Employee_Rating' > 4.5
high_rating_employees = df[df['Employee_Rating'] > 4.5]

# Print the selected rows
print(high_rating_employees)

                   Name              Company_Name  \
4         Theresa Owens  Baker, Allen and Edwards
10      Victoria Sutton   White, Mcclain and Cobb
13          David Duran             Nichols-James
14           Julie Cook              Matthews Inc
49      Gerald Santiago            Thomas-Spencer
...                 ...                       ...
299910   Daniel Johnson  Baker, Allen and Edwards
299952    Joshua Knight             Nichols-James
299957  Martha Phillips              Matthews Inc
299973     Doris Miller               Andrade LLC
299981   Herbert Bailey             Nichols-James

                                       Employee_Job_Title     Employee_City  \
4                                     Production engineer         Whiteside
10                                        Naval architect         Whiteside
13                           Investment banker, corporate    New Russellton
14                                        Equities trader    New Russellton
49                           Garment/textile technologist       Kristaburgh
...                                                   ...               ...
299910                                     Energy manager          Wardfort
299952                  Sales promotion account executive          Wardfort
299957                                    Naval architect          Wardfort
299973  Armed forces logistics/support/administrative ...          Wardfort
299981                          Radiographer, therapeutic  New Cindychester

       Employee_Country  Employee_Salary Employment_Status  Employee_Rating  \
4              Dominica         523499.0         Full Time              4.8
10               Poland         656260.0         Full Time              4.9
13              Georgia         910210.0         Full Time              4.9
14          Puerto Rico         328860.0         Full Time              4.8
49          El Salvador         873320.0         Full Time              4.7
...                 ...              ...               ...              ...
299910   American Samoa         452970.0         Full Time              4.7
299952             Mali         175450.0            Intern              4.9
299957          Somalia         485270.0         Full Time              4.8
299973       Kazakhstan         943340.0            Intern              5.0
299981         Guernsey         165550.0         Full Time              4.8

       First_Name Last_Name
4         Theresa     Owens
10       Victoria    Sutton
13          David     Duran
14          Julie      Cook
49         Gerald  Santiago
...           ...       ...
299910     Daniel   Johnson
299952     Joshua    Knight
299957     Martha  Phillips
299973      Doris    Miller
299981    Herbert    Bailey

[26978 rows x 10 columns]

### 82. Select rows with employee rating > 4.5 and < 4.8.

In [88]:
# Select rows with 'Employee_Rating' > 4.5 and < 4.8
filtered_employees = df[(df['Employee_Rating'] > 4.5) & (df['Employee_Rating'] < 4.8)]
print(filtered_employees)

                    Name                  Company_Name  \
49       Gerald Santiago                Thomas-Spencer
88         Julie Richard              Bullock-Carrillo
94        Natasha Harmon                  Matthews Inc
119        Jason Parrish                   Andrade LLC
129       Connie Coleman                   Andrade LLC
...                  ...                           ...
299757     Melissa Perry             Marshall-Holloway
299765    Jeremy Ramirez                Thomas-Spencer
299772         Adam Moss  Johnston, Fleming and Tanner
299820  Brandi Christian                James and Sons
299910    Daniel Johnson      Baker, Allen and Edwards

                             Employee_Job_Title      Employee_City  \
49                 Garment/textile technologist        Kristaburgh
88                              Naval architect           Wardfort
94                    Radiographer, therapeutic     West Jamesview
119                Garment/textile technologist         Aliciafort
129                                 Optometrist        Kristaburgh
...                                         ...                ...
299757                Trading standards officer          Whiteside
299765  Diplomatic Services operational officer       Ricardomouth
299772             Garment/textile technologist          Whiteside
299820                                     Make  North Melissafurt
299910                           Energy manager           Wardfort

                        Employee_Country  Employee_Salary Employment_Status  \
49                           El Salvador         873320.0         Full Time
88                               Burundi         222850.0         Full Time
94                               Bolivia         790000.0         Full Time
119                        Cote d'Ivoire         581130.0         Full Time
129                            Indonesia         899260.0         Full Time
...                                  ...              ...               ...
299757                Russian Federation         712460.0         Full Time
299765                       Netherlands         330640.0            Intern
299772  Lao People's Democratic Republic         298790.0            Intern
299820             Palestinian Territory         503370.0            Intern
299910                    American Samoa         452970.0         Full Time

        Employee_Rating First_Name  Last_Name
49                  4.7     Gerald   Santiago
88                  4.6      Julie    Richard
94                  4.7    Natasha     Harmon
119                 4.7      Jason    Parrish
129                 4.7     Connie    Coleman
...                 ...        ...        ...
299757              4.7    Melissa      Perry
299765              4.6     Jeremy    Ramirez
299772              4.6       Adam       Moss
299820              4.6     Brandi  Christian
299910              4.7     Daniel    Johnson

[11866 rows x 10 columns]

### 83. Print the name of the company with the maximum employees having rating > 4.

In [90]:
# Filter rows with 'Employee_Rating' > 4
high_rating_employees = df[df['Employee_Rating'] > 4]

# Group by 'Company_Name' and count the number of employees
company_employee_counts = high_rating_employees['Company_Name'].value_counts()

# Get the company with the maximum employees having rating > 4
company_with_max_employees = company_employee_counts.idxmax()

# Print the company name
print(f"The company with the maximum employees having a rating > 4 is: {company_with_max_employees}")

The company with the maximum employees having a rating > 4 is: Matthews Inc

### 84. Print the rating of the employee named 'Julie Morton'.

In [92]:
# Filter the DataFrame for the employee named 'Julie Morton'
julie_morton_rating = df[df['Name'] == 'Julie Morton']['Employee_Rating']

# Print the rating of 'Julie Morton'
if not julie_morton_rating.empty:
    print(f"The rating of Julie Morton is: {julie_morton_rating.iloc[0]}")
else:
    print("Julie Morton is not found in the dataset.")

The rating of Julie Morton is: 4.3

### 85. Print the last 3rd entry in the column Employee_City

In [93]:
# Get the third-to-last entry in the 'Employee_City' column
third_last_employee_city = df['Employee_City'].iloc[-3]

# Print the third-to-last entry
print(f"The third-to-last entry in the 'Employee_City' column is: {third_last_employee_city}")

The third-to-last entry in the 'Employee_City' column is: New Cindychester

### 86. Print the Employee_City column as a list

In [98]:
# Convert the 'Employee_City' column to a list
employee_city_list = df['Employee_City'].tolist()

# Print the list
print(employee_city_list)

IOPub data rate exceeded.
The notebook server will temporarily stop sending output
to the client in order to avoid crashing it.
To change this limit, set the config variable
`--NotebookApp.iopub_data_rate_limit`.

Current values:
NotebookApp.iopub_data_rate_limit=1000000.0 (bytes/sec)
NotebookApp.rate_limit_window=3.0 (secs)

In [99]:
# Convert the 'Employee_City' column to a list
employee_city_list = df['Employee_City'].tolist()

# Print the first 10 entries of the list to avoid exceeding data rate limit
print(employee_city_list[:10])

# Optionally, print the length of the list to confirm the total number of entries
print(f"Total number of entries in 'Employee_City': {len(employee_city_list)}")

['New Russellton', 'North Melissafurt', 'Wardfort', 'West Jamesview', 'Whiteside', 'Ricardomouth', 'Wardfort', 'Kristaburgh', 'West Jamesview', 'New Cindychester']
Total number of entries in 'Employee_City': 300000

### 87. Are the number of employees in 'Scott Inc' company greater than that in 'Andrade LLC'? Print True/False

In [100]:
# Count the number of employees in 'Scott Inc'
scott_inc_count = df[df['Company_Name'] == 'Scott Inc'].shape[0]

# Count the number of employees in 'Andrade LLC'
andrade_llc_count = df[df['Company_Name'] == 'Andrade LLC'].shape[0]

# Compare the counts and print True/False
is_scott_inc_greater = scott_inc_count > andrade_llc_count
print(is_scott_inc_greater)

True

### 88. Which is the most common first name in the dataframe?

In [102]:
# Split the 'Employee_Name' column to extract first names
first_names = df['Name'].apply(lambda x: x.split()[0])

# Count the occurrences of each first name
first_name_counts = first_names.value_counts()

# Get the most common first name
most_common_first_name = first_name_counts.idxmax()

# Print the most common first name
print(f"The most common first name in the dataset is: {most_common_first_name}")

The most common first name in the dataset is: Michael

### 89. Which is the least common last name in the dataframe?

In [103]:
# Split the 'Employee_Name' column to extract last names
last_names = df['Name'].apply(lambda x: x.split()[-1])

# Count the occurrences of each last name
last_name_counts = last_names.value_counts()

# Get the least common last name
least_common_last_name = last_name_counts.idxmin()

# Print the least common last name
print(f"The least common last name in the dataset is: {least_common_last_name}")

The least common last name in the dataset is: Madden

### 90. What is the average name length?

In [105]:
# Calculate the length of each name
name_lengths = df['Name'].apply(len)

# Compute the average name length
average_name_length = name_lengths.mean()

# Print the average name length
print(f"The average length of names in the dataset is: {average_name_length:.2f}")

The average length of names in the dataset is: 13.11

Great job solving this notebook. Go to Pandas Notebook  3: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-Notebook-employee-part-2-adc5a3ee-5f61-4725-8e46-ccb07899acfc/%2Fnotebook.ipynb)

<a style='text-decoration:none;line-height:16px;display:flex;color:#5B5B62;padding:10px;justify-content:end;' href='https://deepnote.com?utm_source=created-in-deepnote-cell&projectId=7e3b6755-5d4b-464b-9b75-9c84667ae3bd' target="_blank">
<img alt='Created in deepnote.com' style='display:inline;max-height:16px;margin:0px;margin-right:7.5px;' src='' > </img>
Created in <span style='font-weight:600;margin-left:4px;'>Deepnote</span></a>